def p1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                      "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                      "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                      "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                      "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(countries_dict)
    strana = input('Введите страну: ')
    print(countries_dict[strana])
    for i in sorted(countries_dict):
        print(i, ' - ', countries_dict[i])

def p2():
    s = 0
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }

    slovo = input('Введите слово: ')
    for i in alph:
        if i in slovo:
            s += alph[i]
    print('Стоимость введенного слова: ', s)

def p3():
    import random
    sp2 = ['Английский', 'Немецкий', 'Испанский', 'Японский', 'Китайский'] #0, 1, 2, 3, 4 - индексы
    sp1 = ['Петров', 'Иванов', 'Сидоров', 'Голубев', 'Кузнецов']
    sp3 = ['', '', '', '', '']
    sp4 = ''
    for i in range(5):
        k = random.randint(1,3)
        for j in range(k):
            g = random.randint(0, 4)
            sp3[i] = sp3[i] + str(g)
            g = 0
        k = 0
    for i in range(5):
        if '4' in sp3[i]:
            sp4 += sp1[i]
            sp4+= ', '
    sp4 = sp4[:len(sp4)-2]
    print(sp3)
    print(sp4)


p1()
p2()
p3()

